ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp

/* Todo*/
// https://github.com/espressif/arduino-esp32/issues/7779


#include "esp_timer.h" // Include the header for the high-resolution timer
#include "esp_partition.h"


#define ESTIMATE_LOADCELL_VARIANCE_B
//#define PRINT_SERVO_STATES

#define DEBUG_INFO_0_CYCLE_TIMER_U8 1U
#define DEBUG_INFO_0_NET_RUNTIME_U8 2U
// #define DEBUG_INFO_0_LOADCELL_READING 4
#define DEBUG_INFO_0_SERVO_READINGS_U8 8U
#define DEBUG_INFO_0_RESET_ALL_SERVO_ALARMS_U8 16U
#define DEBUG_INFO_0_RESET_SERVO_TO_FACTORY_U8 32U
#define DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT_U8 64U
#define DEBUG_INFO_0_LOG_ALL_SERVO_PARAMS_U8 128U


#define EFFECT_SCALING_FACTOR_FL32 4.0f
#define EFFECT_POSITION_SCALING_FACTOR_FL32 0.1f

#define BAUD_3M_U32 3000000U
#define DEFAULT_BAUD_U32 921600U

#include "Arduino.h"
#include "Main.h"
#ifdef CONFIG_IDF_TARGET_ESP32S3
  #include "soc/soc.h"
  #include "soc/rtc_cntl_reg.h"
#endif
Stream *ActiveSerial = nullptr;

#include "Version_Board.h"
#include "PedalInfoBuilder.h"
#ifdef Using_analog_output_ESP32_S3
#include <Wire.h>
#include <Adafruit_MCP4725.h>
  TwoWire MCP4725_I2C= TwoWire(1);
  //MCP4725 MCP(0x60, &MCP4725_I2C);
  Adafruit_MCP4725 dac;
  int current_use_mcp_index;
  bool MCP_status =false;
#endif


#include "FastTrig.h"



//#define ALLOW_SYSTEM_IDENTIFICATION


#include "DiyActivePedal_types.h"


/**********************************************************************************************/
/*                                                                                            */
/*                         variable declarations                                              */
/*                                                                                            */
/**********************************************************************************************/
DapConfigClass global_dap_config_class;
DRAM_ATTR DapCalculationVariables_t dap_calculationVariables_st;
DapEspPairing_t dap_esppairing_st;//saving
DapEspPairing_t dap_esppairing_lcl;//sending
DapActionOta_t dap_action_ota_st;//OTA command(do not check version)



/**********************************************************************************************/
/*                                                                                            */
/*                         struct definitions                                                 */
/*                                                                                            */
/**********************************************************************************************/
typedef struct {
    DapStateBasic_t    basic_st;
    DapStateExtended_t extended_st;
    bool sendBasicFlag_b;
    bool sendExtendedFlag_b;
} PedalStatePackage_t;

typedef struct {
    uint16_t joystickNormalizedToUInt16;
    bool sendJoystickFlag_b;
} joystickDataPackage_t;

typedef struct {
    float loadcellReadingInKg_fl32;
} loadcellDataPackage_t;

typedef struct {
    DapConfig_t config_st;
} configDataPackage_t;

enum TxMessageType {
    TX_MSG_PEDAL_STATE,
    TX_MSG_CONFIG
};

struct TxMessage_t {
    TxMessageType type;
    union {
        PedalStatePackage_t pedalState;
        DapConfig_t config;
    } payload;
};

/**********************************************************************************************/
/*                                                                                            */
/*                         function declarations                                              */
/*                                                                                            */
/**********************************************************************************************/
void updatePedalCalcParameters(const DapConfig_t& newConfig);
void pedalUpdateTask( void * pvParameters );
void loadcellReadingTask( void * pvParameters );
void profilerTask( void * pvParameters );
void serialCommunicationTaskRx( void * pvParameters );
void serialCommunicationTaskTx( void * pvParameters );
void serialTxPumpTask( void * pvParameters );
void otaUpdateTask( void * pvParameters );
void espNowCommunicationTaskTx( void * pvParameters);
void miscTask( void * pvParameters);
void configUpdateTask( void * pvParameters );
void servoConfigHandlingTask( void * pvParameters );

#ifdef USB_JOYSTICK
  void joystickOutputTask( void * pvParameters );
#endif


#define INCLUDE_vTaskDelete 1
// https://www.tutorialspoint.com/cyclic-redundancy-check-crc-in-arduino
inline uint16_t checksumCalculator_u16(uint8_t * data_pu8, uint16_t length_u16)
{
  uint16_t curr_crc_u16 = 0x0000;
  uint8_t sum1_u8 = (uint8_t) curr_crc_u16;
  uint8_t sum2_u8 = (uint8_t) (curr_crc_u16 >> 8);
  int index_i32;
  for(index_i32 = 0; index_i32 < length_u16; index_i32 = index_i32 + 1)
   {
    sum1_u8 = (sum1_u8 + data_pu8[index_i32]) % 255;
    sum2_u8 = (sum2_u8 + sum1_u8) % 255;
   }
  return (sum2_u8 << 8) | sum1_u8;
}




unsigned long saveToEEPRomDuration=0;



bool splineDebug_b = false;



#include <EEPROM.h>
#define EEPROM_OFFSET_U32 15U


#include "ABSOscillation.h"
#include "Rudder.h"
ABSOscillation absOscillation;
RpmEffect g_rpmEffect_st;
BitePointOscillation g_bitePointOscillation_st;
GForceEffect g_gForceEffect_st;
WheelSlipOscillation g_wheelSlipOscillation_st;
RoadImpactEffect g_roadImpactEffect_st;
CustomVibration g_customVibration1_st;
CustomVibration g_customVibration2_st;
CustomVibration g_customVibration3_st;
CustomVibration g_customVibration4_st;
Rudder g_rudder_st;
HelicoptersRudder g_helicopterRudder_st;
RudderGForce g_rudderGForce_st;
MovingAverageFilter g_averageFilterJoystick_st(40);




/**********************************************************************************************/
/*                                                                                            */
/*                         Predictive Brake Controller                                        */
/*                                                                                            */
/**********************************************************************************************/
#include "PredictiveBrakeController.h"
PredictiveBrakeController brakeController;

/**********************************************************************************************/
/*                                                                                            */
/*                         iterpolation  definitions                                          */
/*                                                                                            */
/**********************************************************************************************/

#include "ForceCurve.h"
ForceCurveInterpolated forceCurve;



/**********************************************************************************************/
/*                                                                                            */
/*                         multitasking  definitions                                          */
/*                                                                                            */
/**********************************************************************************************/
#ifndef CONFIG_IDF_TARGET_ESP32S3
  #include "rtc_wdt.h"
#endif






/**********************************************************************************************/
/*                                                                                            */
/*                         queue declarations                                                 */
/*                                                                                            */
/*                                                                                            */
/**********************************************************************************************/
// ADD THIS: The handle for our new FreeRTOS queue
static QueueHandle_t s_unifiedTxQueue = NULL;
#ifdef ESPNOW_Enable
static QueueHandle_t s_espnowStateQueue = NULL;
#endif
static QueueHandle_t s_joystickDataQueue = NULL;
static QueueHandle_t s_loadcellDataQueue = NULL;
static QueueHandle_t s_configUpdateAvailableQueue = NULL;
static QueueHandle_t s_configUpdateSendToPedalUpdateTaskQueue = NULL;
static QueueHandle_t s_configUpdateSendToLoadcellTaskQueue = NULL;
static QueueHandle_t s_actionCommandQueue = NULL;
static QueueHandle_t s_configUpdateSendToSerialRXTaskQueue = NULL;
static QueueHandle_t s_systemControlQueue = NULL;
QueueHandle_t s_servoConfigRxQueue = NULL;









/**********************************************************************************************/
/*                                                                                            */
/*                         target-specific  definitions                                       */
/*                                                                                            */
/**********************************************************************************************/




/**********************************************************************************************/
/*                                                                                            */
/*                         controller  definitions                                            */
/*                                                                                            */
/**********************************************************************************************/
#include "UsbComManager.h"
UsbComManager usbManager; 

#if defined(USE_CDC_INSTEAD_OF_UART)
    USBCDC customUsbSerial;
#endif



/**********************************************************************************************/
/*                                                                                            */
/*                         pedal mechanics definitions                                        */
/*                                                                                            */
/**********************************************************************************************/

#include "PedalGeometry.h"
float motorRevolutionsPerSteps_fl32 = 1.0f / 3200.0f;


/**********************************************************************************************/
/*                                                                                            */
/*                         Kalman filter definitions                                          */
/*                                                                                            */
/**********************************************************************************************/

