ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
#include "SignalFilter_1st_order.h"
KalmanFilter1stOrder* kalman = NULL;
KalmanFilter1stOrder* kalman_joystick = NULL;

#include "SignalFilter_2nd_order.h"
KalmanFilter2ndOrder* kalman_2nd_order = NULL;




/**********************************************************************************************/
/*                                                                                            */
/*                         loadcell definitions                                               */
/*                                                                                            */
/**********************************************************************************************/

#ifdef USES_ADS1220
  /*  Uses ADS1220 */
  #include "LoadCell_ads1220.h"
  LoadCellAds1220* loadcell = NULL;

#else
  /*  Uses ADS1256 */
  #include "LoadCell.h"
  LoadCellAds1256* loadcell = NULL;
#endif


/**********************************************************************************************/
/*                                                                                            */
/*                         stepper motor definitions                                          */
/*                                                                                            */
/**********************************************************************************************/

#include "StepperWithLimits.h"
StepperWithLimits* stepper = NULL;
//static const int32_t MIN_STEPS = 5;

#include "StepperMovementStrategy.h"
#include "StepperMovementStrategy_MPC.h"
#include "ChatterReduction.h"
volatile bool moveSlowlyToPosition_b = true;
/**********************************************************************************************/
/*                                                                                            */
/*                         OTA                                                                */
/*                                                                                            */
/**********************************************************************************************/
//OTA update
#ifdef OTA_update
//#include "ota.h"
#include "OTA_Pull.h"
#include "OTA_ArduinoOTA.h"
char* g_apHost_pc;
#endif
#ifdef OTA_update_ESP32
  #include "ota.h"
  //#include "OTA_Pull.h"
  TaskHandle_t Task4;
  char* g_apHost_pc;
#endif

#if !defined(OTA_update) && !defined(OTA_update_ESP32)
  #include "ota.h"
#endif


//ESPNOW
#ifdef ESPNOW_Enable
  #include "ESPNOW_lib.h"
  TaskHandle_t Task6;
#endif

#ifdef USING_LED
  #include "soc/soc_caps.h"
  #include <Adafruit_NeoPixel.h>
  #define LEDS_COUNT 1
  #ifdef LED_ENABLE_RGB
    Adafruit_NeoPixel pixels(LEDS_COUNT, LED_GPIO_U8, NEO_RGB + NEO_KHZ800);
  #else
    Adafruit_NeoPixel pixels(LEDS_COUNT, LED_GPIO_U8, NEO_GRB + NEO_KHZ800);
  #endif
  #define CHANNEL 0
  #define LED_BRIGHT 30
  /*
  static const crgb_t L_RED = 0xff0000;
  static const crgb_t L_GREEN = 0x00ff00;
  static const crgb_t L_BLUE = 0x0000ff;
  static const crgb_t L_WHITE = 0xe0e0e0;
  static const crgb_t L_YELLOW = 0xffde21;
  static const crgb_t L_ORANGE = 0xffa500;
  static const crgb_t L_CYAN = 0x00ffff;
  static const crgb_t L_PURPLE = 0x800080;
  */
#endif


#include "Buzzer.h"
SimpleBuzzer Buzzer;
bool buzzerBeepAction_b = false;
#include <cstring>


/**********************************************************************************************/
/*                                                                                            */
/*                         profiler setup                                                     */
/*                                                                                            */
/**********************************************************************************************/
#include "FunctionProfiler.h"





/**********************************************************************************************/
/*                                                                                            */
/*                         config reading                                                     */
/*                                                                                            */
/**********************************************************************************************/
void IRAM_ATTR_FLAG configHandlingTask( void * pvParameters )
{
  DapConfig_t dap_config_st_local;
  configDataPackage_t configPackage_st;

  for (;;)
  {

    // check if config update is available
    if (xQueueReceive(s_configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY) == pdPASS)
    {
      global_dap_config_class.setConfig(configPackage_st.config_st);

      ActiveSerial->println("Config update received: config handling task");

      // send queues to other tasks

      // Send the package to the queue. Use a timeout of 0 (non-blocking).
      // If the queue is full, the data is simply dropped. This prevents this
      // high-priority control task from ever blocking on a full serial buffer.
      xQueueSend(s_configUpdateSendToPedalUpdateTaskQueue, &configPackage_st, portMAX_DELAY);
      xQueueSend(s_configUpdateSendToLoadcellTaskQueue, &configPackage_st, portMAX_DELAY);
      // xQueueSend(configUpdateSendToJoystickTaskQueue, &configPackage_st, portMAX_DELAY);
      xQueueSend(s_configUpdateSendToSerialRXTaskQueue, &configPackage_st, portMAX_DELAY);

    }
  }
}



/**********************************************************************************************/
/*                                                                                            */
/*                         loadcell reading                                                   */
/*                                                                                            */
/**********************************************************************************************/
void IRAM_ATTR_FLAG loadcellReadingTask( void * pvParameters )
{

  static FunctionProfiler profiler_loadcellReading;
  profiler_loadcellReading.setName("loadcellReading");
  profiler_loadcellReading.setNumberOfCalls(3000);

  static float loadcellReading_fl32 = 0.0f;
  static DapConfig_t loadcellTask_dap_config_st;
  configDataPackage_t configPackage_st;

