ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
  static float previousLoadcellReadingInKg_fl32 = 0.0f;

  for (;;)
  {

    if (loadcell != NULL)
    {

      // if new data package is available, update the local config
      if (xQueueReceive(s_configUpdateSendToLoadcellTaskQueue, &configPackage_st, (TickType_t)0) == pdPASS)
      {
        loadcellTask_dap_config_st = configPackage_st.config_st;

        // activate profiler depending on pedal config
        if (loadcellTask_dap_config_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_CYCLE_TIMER_U8) 
        {
          profiler_loadcellReading.activate( true );
        }
        else
        {
          profiler_loadcellReading.activate( false );
        }

        ActiveSerial->println("Update config: loadcell task");
      }     

      // start profiler 0, overall function
      profiler_loadcellReading.start(0);

      // no need for delay, since getReadingKg will block until DRDY edge down is detected
      loadcellReading_fl32 = loadcell->readLoadcellWeightInKg();

      // Invert the loadcell reading digitally if desired
      if (loadcellTask_dap_config_st.payloadPedalConfig_st.invertLoadcellReading_u8 == 1)
      {
        loadcellReading_fl32 *= -1.0f;
      }

      // detect loadcell outlier
      float loadcellDifferenceToLastCycle_fl32 = loadcellReading_fl32 - previousLoadcellReadingInKg_fl32;
      previousLoadcellReadingInKg_fl32 = loadcellReading_fl32;
      
      if (fabsf(loadcellDifferenceToLastCycle_fl32) < 5.0f)
      {
        // reject update when loadcell reading likely outlier
          
        float medianReading_fl32;
      #ifdef USE_MEDIAN_FILTER_FOR_LOADCELL_READING
        static const uint8_t filterLength_u8 = 15; // Parameterizable up to 16
        static float filterBuffer_fl32[16] = {0.0f};
        static uint8_t bufferIndex_u8 = 0;
        
        // Add new reading to circular buffer
        filterBuffer_fl32[bufferIndex_u8] = loadcellReading_fl32;
        bufferIndex_u8 = (bufferIndex_u8 + 1) % filterLength_u8;
        
        // Copy to temporary array for sorting
        float sortedBuffer_fl32[16];
        for (uint8_t i = 0; i < filterLength_u8; i++) {
            sortedBuffer_fl32[i] = filterBuffer_fl32[i];
        }
        
        // Simple insertion sort for up to 16 elements
        for (uint8_t i = 1; i < filterLength_u8; i++) {
            float key = sortedBuffer_fl32[i];
            int8_t j = i - 1;
            while (j >= 0 && sortedBuffer_fl32[j] > key) {
                sortedBuffer_fl32[j + 1] = sortedBuffer_fl32[j];
                j--;
            }
            sortedBuffer_fl32[j + 1] = key;
        }
        
        // Calculate median
        
        if (filterLength_u8 % 2 == 0) {
            medianReading_fl32 = (sortedBuffer_fl32[filterLength_u8 / 2 - 1] + sortedBuffer_fl32[filterLength_u8 / 2]) / 2.0f;
        } else {
            medianReading_fl32 = sortedBuffer_fl32[filterLength_u8 / 2];
        }
      #else
        medianReading_fl32 = loadcellReading_fl32;
      #endif

        // send joystick data to queue
        if (s_loadcellDataQueue != NULL)
        {

          // Package the new state data into a single struct
          loadcellDataPackage_t newLoadcellPackage;
          newLoadcellPackage.loadcellReadingInKg_fl32 = loadcellReading_fl32;
          newLoadcellPackage.loadcellReadingInKg_fl32 = medianReading_fl32;

            // Send the package to the queue. Use a timeout of 0 (non-blocking).
            // If the queue is full, the data is simply dropped. This prevents this
            // high-priority control task from ever blocking on a full serial buffer.
          xQueueSend(s_loadcellDataQueue, &newLoadcellPackage, (TickType_t)0);
        }
      }
      
      
      


      profiler_loadcellReading.end(0);

      // print profiler results
      // profiler_loadcellReading.report();


    }

    // force a context switch
		taskYIELD();
  }
}



// === Scheduler config ===
#define BASE_TICK_US REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US_I64   // base tick in microseconds
#define MAX_TASKS    10     // maximum tasks in scheduler


// Task entry struct
typedef struct {
  TaskHandle_t handle;
  const char *name;
  TaskFunction_t fn;
  uint16_t intervalTicks;
  uint16_t counter;
  uint32_t lastKick;   // last time task ran (micros)
  UBaseType_t priority;
  BaseType_t core;
} SchedTask;

// Task table
DRAM_ATTR SchedTask tasks[MAX_TASKS];
uint8_t taskCount = 0;

// Timer handle
hw_timer_t *timer0 = NULL;

// === Scheduler ISR ===
void IRAM_ATTR_FLAG onTimer() {
  BaseType_t xHigherPriorityWoken = pdFALSE;

  for (int i = 0; i < taskCount; i++) {
    tasks[i].counter++;
    if (tasks[i].counter >= tasks[i].intervalTicks) {
      tasks[i].counter = 0;
      if(NULL != tasks[i].handle)
      {
        vTaskNotifyGiveFromISR(tasks[i].handle, &xHigherPriorityWoken);
      }
      
    }
  }

  // Yield if a higher-priority task was woken.
  if (xHigherPriorityWoken) 
  {
    portYIELD_FROM_ISR();
  }
}

// === Scheduler API ===
void addScheduledTask(TaskFunction_t fn, const char *name, uint16_t intervalUs,
                      UBaseType_t priority, BaseType_t core, uint32_t stackSize = 2048u) {
  if (taskCount >= MAX_TASKS) return;  // limit reached

  uint16_t intervalTicks = intervalUs / BASE_TICK_US;
  if (intervalTicks == 0) intervalTicks = 1;  // minimum 1 tick

  // Create task
  xTaskCreatePinnedToCore(fn, name, stackSize, NULL, priority,
                          &tasks[taskCount].handle, core);

  tasks[taskCount].intervalTicks = intervalTicks;
  tasks[taskCount].counter = 0;
  tasks[taskCount].name = name;
  taskCount++;
}




TaskHandle_t handle_pedalUpdateTask = NULL;
TaskHandle_t handle_joystickOutput = NULL;
TaskHandle_t handle_loadcellReadingTask = NULL;
TaskHandle_t handle_profilerTask = NULL;
TaskHandle_t handle_serialCommunicationRx = NULL; 
TaskHandle_t handle_serialCommunicationTx = NULL; 
TaskHandle_t handle_miscTask = NULL; 
TaskHandle_t handle_otaTask = NULL;
TaskHandle_t handle_espnowTask = NULL;
TaskHandle_t handle_configHandlingTask = NULL;
TaskHandle_t handle_servoConfigHandlingTask = NULL;

#define COUNTER_SIZE_U32 4u
uint16_t tickCount_au16[COUNTER_SIZE_U32] = {0};


