ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
static uint16_t s_timerTicks_espNowTask_u16 = REPETITION_INTERVAL_ESPNOW_TASK_IN_US_I64 / BASE_TICK_US;




/**********************************************************************************************/
/*                                                                                            */
/*                         setup function                                                     */
/*                                                                                            */
/**********************************************************************************************/
 // #define SERIAL_PATTERN_DETECTOR
#ifdef SERIAL_PATTERN_DETECTOR

#include "driver/uart.h"

// Structure to hold a complete UART packet
#define UART_RX_BUF_SIZE_U32 sizeof(DapConfig_t)
typedef struct {
  uint8_t data[UART_RX_BUF_SIZE_U32];
    size_t len;
} UartPacket_t;

// Queue to pass packets from the UART event task to the processing task
static QueueHandle_t s_serial_packet_queue;

// Queue to handle UART events
static QueueHandle_t s_uart_queue;

// --- ADD THIS LINE ---
#define TEMP_BUFFER_SIZE_U32 (UART_RX_BUF_SIZE_U32 * 2)

/**
 * @brief Task to handle UART events with persistent buffering.
 *
 * This task accumulates data in a static buffer. After new data arrives,
 * it scans the buffer for one or more complete packets ending in the
 * {EOF_BYTE_0_U8, EOF_BYTE_1_U8} sequence. Valid packets are extracted, queued
 * for processing, and removed from the buffer.
 */
static void uart_event_task(void *pvParameters) {
    uart_event_t event;
    
    // Persistent buffer to accumulate fragmented data
    static uint8_t temp_buffer[TEMP_BUFFER_SIZE_U32];
    static size_t temp_buffer_len = 0;

    for (;;) {
        // Wait for a UART event
        if (xQueueReceive(s_uart_queue, (void *)&event, (TickType_t)portMAX_DELAY)) {
            
            ActiveSerial->println("UART event triggered");

            switch (event.type) {
                case UART_PATTERN_DET: {

                    ActiveSerial->println("EOF1 detected");

                    // // Read all available new data from the hardware buffer
                    // uint8_t incoming_data[UART_RX_BUF_SIZE_U32];
                    // size_t buffered_size;
                    // uart_get_buffered_data_len(UART_NUM_0, &buffered_size);
                    // int read_len = uart_read_bytes(UART_NUM_0, incoming_data, buffered_size, pdMS_TO_TICKS(100));

                    // if (read_len > 0) {
                    //     // --- 1. Append new data, checking for overflow ---
                    //     if (temp_buffer_len + read_len > TEMP_BUFFER_SIZE_U32) {
                    //         ActiveSerial->println("ERROR: UART temporary buffer overflow. Discarding all data.");
                    //         temp_buffer_len = 0; // Reset the buffer
                    //         break; 
                    //     }
                    //     memcpy(&temp_buffer[temp_buffer_len], incoming_data, read_len);
                    //     temp_buffer_len += read_len;

                    //     // --- 2. Scan buffer for complete packets and process them ---
                    //     if (temp_buffer[temp_buffer_len-2] == EOF_BYTE_0_U8 && temp_buffer[temp_buffer_len-1] == EOF_BYTE_1_U8) {
                            

                    //         // --- 3. Extract the packet and send it to the queue ---
                    //         UartPacket_t packet_to_send;
                    //         packet_to_send.len = temp_buffer_len;
                    //         memcpy(packet_to_send.data, temp_buffer, temp_buffer_len);
                    //         xQueueSend(s_serial_packet_queue, &packet_to_send, (TickType_t)0);

                    //         // --- 4. Remove the processed packet by shifting the buffer ---
                    //         size_t remaining_len = 0;//temp_buffer_len - packet_len;
                    //         temp_buffer_len = remaining_len;
                    //     }
                    //   }
                    }
                    break;
                

                // --- Error handling cases remain the same ---
                case UART_FIFO_OVF:
                    ActiveSerial->println("Hardware FIFO overflow");
                    uart_flush_input(UART_NUM_0);
                    xQueueReset(s_uart_queue);
                    temp_buffer_len = 0; // Also clear our temp buffer
                    break;

                case UART_BUFFER_FULL:
                    ActiveSerial->println("Ring buffer full");
                    uart_flush_input(UART_NUM_0);
                    xQueueReset(s_uart_queue);
                    temp_buffer_len = 0; // Also clear our temp buffer
                    break;
                
                default:
                    uart_flush_input(UART_NUM_0);
                    break;
            }
        }
    }
    vTaskDelete(NULL);
}

#endif


void setup()
{

  

  #ifdef DEBUG_KEEP_USB_SERIAL_JTAG
    // For ESP32-S3, the USB Serial is shared with JTAG. To allow debugging via JTAG while also using Serial for output, we can delay the start of Serial until after the debugger has had time to connect.
    // This is a workaround to ensure that the USB Serial doesn't interfere with JTAG debugging during startup. 
    delay(5000); // Gibt dem Debugger 5 Sekunden Zeit, sich in Ruhe zu verbinden!
  #endif

  // stabilize RS232 pins, so servo doesnt go into alarm on startup
  pinMode(ISV57_TXPIN, OUTPUT);
  digitalWrite(ISV57_TXPIN, HIGH); // HIGH ist der Idle-State für UART

  // disable WIFI & Bluetooth to improve loadcell reading. 
  // HINT: The ESP32 S3 zero board doen't have strong 5V signal smoothing hardware as the regular S3 devboard. 
  #ifdef WIFI_DISABLE
    WiFi.mode(WIFI_OFF);
    btStop();
  #endif
  DapConfig_t dap_config_st_local;
  DapConfig_t dap_config_st_eeprom;

  // 1. EEPROM sehr früh laden, um den korrekten Pedal-Namen für das USB-Setup zu ermitteln
  EEPROM.begin(2048);
  global_dap_config_class.loadConfigFromEeprom();
  global_dap_config_class.getConfig(&dap_config_st_eeprom, 500);
  
