ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
  bool earlyConfigValid_b = true;
  if (dap_config_st_eeprom.payloadHeader_st.payloadType_u8 != DAP_PAYLOAD_TYPE_CONFIG_U8) earlyConfigValid_b = false;
  if (dap_config_st_eeprom.payloadHeader_st.version_u8 != DAP_VERSION_CONFIG_U8) earlyConfigValid_b = false;
  uint16_t earlyCrc = checksumCalculator_u16((uint8_t*)(&(dap_config_st_eeprom.payloadHeader_st)), sizeof(dap_config_st_eeprom.payloadHeader_st) + sizeof(dap_config_st_eeprom.payloadPedalConfig_st));
  if (earlyCrc != dap_config_st_eeprom.payloadFooter_st.checkSum_u16) earlyConfigValid_b = false;

  if (earlyConfigValid_b) {
    dap_config_st_local.payloadPedalConfig_st.pedalType_u8 = dap_config_st_eeprom.payloadPedalConfig_st.pedalType_u8;
  }

  #if defined(PEDAL_SOFTWARE_ASSIGNMENT) && defined(ESPNOW_Enable)
    DapAssignmentReg_t dap_assignement_reg_local;
    EEPROM.get(ASSIGNMENT_EEPROM_OFFSET_U32, dap_assignement_reg_local);
    uint16_t crcAssign = checksumCalculator_u16((uint8_t *)(&dap_assignement_reg_local), sizeof(DapAssignmentReg_t) - sizeof(uint16_t));
    if (dap_assignement_reg_local.payloadType_u8 == DAP_PAYLOAD_TYPE_ASSIGNMENT_U8 && 
        dap_assignement_reg_local.magicKey_u8 == ESPNOW_ASSIGNMENT_MAGIC_KEY && 
        crcAssign == dap_assignement_reg_local.crc_u16) {
        
        if (dap_assignement_reg_local.deviceId_u8 == PEDAL_ID_CLUTCH || 
            dap_assignement_reg_local.deviceId_u8 == PEDAL_ID_BRAKE || 
            dap_assignement_reg_local.deviceId_u8 == PEDAL_ID_THROTTLE) {
          dap_config_st_local.payloadPedalConfig_st.pedalType_u8 = dap_assignement_reg_local.deviceId_u8;
        }
    }
  #endif

  #ifdef PEDAL_HARDWARE_ASSIGNMENT
    pinMode(CFG1_U8, INPUT_PULLUP);
    pinMode(CFG2_U8, INPUT_PULLUP);
    delay(50); // give the pin time to settle
    uint8_t CFG1_reading = digitalRead(CFG1_U8);
    uint8_t CFG2_reading = digitalRead(CFG2_U8);
    uint8_t Pedal_assignment = CFG1_reading * 2 + CFG2_reading * 1; // 00=clutch 01=brk  02=gas
    if (Pedal_assignment != PEDAL_ID_ASSIGNMENT_ERROR && Pedal_assignment != PEDAL_ID_UNKNOWN) {
      dap_config_st_local.payloadPedalConfig_st.pedalType_u8 = Pedal_assignment;
    }
  #endif

  // Manager starten (er übernimmt CDC und Controller-Setup mit der finalen Identität)
  usbManager.begin(dap_config_st_local.payloadPedalConfig_st.pedalType_u8);
  
  // System-Pointer auf den Manager umbiegen
  ActiveSerial = &usbManager;



  // The queue can hold up to N state packages.
  // Depth = 200: holds 50 ms of 4 kHz production (4000 ? 0.05 = 200 items)
  // giving ample margin even if the TX task is briefly delayed by USB activity.
  s_unifiedTxQueue = xQueueCreate(60, sizeof(TxMessage_t));
  if (s_unifiedTxQueue == NULL)
  {
    ActiveSerial->println("Error creating the unified TX queue!");
  }
  s_joystickDataQueue = xQueueCreate(1, sizeof(joystickDataPackage_t));
  if (s_joystickDataQueue == NULL)
  {
    ActiveSerial->println("Error creating the joystick data queue!");
  }
  s_loadcellDataQueue = xQueueCreate(1, sizeof(loadcellDataPackage_t));
  if (s_loadcellDataQueue == NULL)
  {
    ActiveSerial->println("Error creating the loadcell data queue!");
  }
  s_configUpdateAvailableQueue = xQueueCreate(1, sizeof(configDataPackage_t));
  if (s_configUpdateAvailableQueue == NULL)
  {
    ActiveSerial->println("Error creating the config data queue!");
  }
  s_configUpdateSendToPedalUpdateTaskQueue = xQueueCreate(1, sizeof(configDataPackage_t));
  if (s_configUpdateSendToPedalUpdateTaskQueue == NULL)
  {
    ActiveSerial->println("Error creating the config data queue!");
  }
  s_configUpdateSendToLoadcellTaskQueue = xQueueCreate(1, sizeof(configDataPackage_t));
  if (s_configUpdateSendToLoadcellTaskQueue == NULL)
  {
    ActiveSerial->println("Error creating the config data queue!");
  }
  // configUpdateSendToJoystickTaskQueue= xQueueCreate(1, sizeof(configDataPackage_t));
  // if (configUpdateSendToJoystickTaskQueue == NULL) {
  //     ActiveSerial->println("Error creating the config data queue!");
  // }
  s_configUpdateSendToSerialRXTaskQueue = xQueueCreate(1, sizeof(configDataPackage_t));
  if (s_configUpdateSendToSerialRXTaskQueue == NULL)
  {
    ActiveSerial->println("Error creating the config data queue!");
  }
  s_actionCommandQueue = xQueueCreate(10, sizeof(DapActions_t));
  if (s_actionCommandQueue == NULL)
  {
    ActiveSerial->println("Error creating the action command queue!");
  }
  s_systemControlQueue = xQueueCreate(5, sizeof(uint8_t));
  if (s_systemControlQueue == NULL)
  {
    ActiveSerial->println("Error creating the system control queue!");
  }
  s_servoConfigRxQueue = xQueueCreate(5, sizeof(DAP_servo_config_st));
  if (s_servoConfigRxQueue == NULL)
  {
    ActiveSerial->println("Error creating the servo config rx queue!");
  }







  xTaskCreatePinnedToCore(
                    configHandlingTask,   /* Task function. */
                    "configHandlingTask",     /* name of task. */
                    3000,       /* Stack size of task */
                    NULL,        /* parameter of the task */
                    TASK_PRIORITY_CONFIG_HANDLING_TASK_UBASETYPE,           /* priority of the task */
                    &handle_configHandlingTask,      /* Task handle to keep track of created task */
                    CORE_ID_CONFIG_HANDLING_TASK_U8);          /* pin task to core 1 */  

  xTaskCreatePinnedToCore(
                    servoConfigHandlingTask,   /* Task function. */
                    "servoConfigHandlingTask",     /* name of task. */
                    3000,       /* Stack size of task */
                    NULL,        /* parameter of the task */
                    TASK_PRIORITY_CONFIG_HANDLING_TASK_UBASETYPE,           /* priority of the task */
                    &handle_servoConfigHandlingTask,      /* Task handle */
                    CORE_ID_CONFIG_HANDLING_TASK_U8);          /* pin task to core 1 */  

  

  

  // setup brake resistor pin
  #ifdef BRAKE_RESISTOR_PIN_U8
    pinMode(BRAKE_RESISTOR_PIN_U8, OUTPUT);  // Set GPIO13 as an output
    digitalWrite(BRAKE_RESISTOR_PIN_U8, LOW);  // Turn the LED on
  #endif

  #ifdef EMERGENCY_PIN_U8
    pinMode(EMERGENCY_PIN_U8,INPUT_PULLUP);
  #endif

  

