ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
          // prevent very small movements, since it will induce pulse frequency 
          // of 1 / (REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US_I64 * 1e-6) Hz = 4000Hz with sign flips
          float distanceToMoveAbs_fl32 = fabsf(distanceToMove);
          
          if (distanceToMoveAbs_fl32 != 0) 
          {
            float deltaTime_s_fl32 = ((float)REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US_I64) * 1e-6f;
            float requiredSpeed = distanceToMoveAbs_fl32 / deltaTime_s_fl32;

            // slightly overspeed to make sure pulses reach in time
            // requiredSpeed *= 1.1f;

            // Catch-up propotional speed gain
            // Hardware distance (integer steps) for fallback and step-loss checks
            int32_t hardwareDistance_i32 = (int32_t)Position_Last_fl32 - stepper->getCurrentPosition();

            float catchUpSpeedHz = 0.0f;

            // add catchup speed only near standstill & near min endstop
            float targetPosFraction_fl32 = stepper->getCurrentPositionFractionFromExternalPos(Position_Next_fl32 - stepper->getMinPosition() );
            if ( (fabsf(requiredSpeed) < 10) && (targetPosFraction_fl32 <= 0.05f) )
            {
              if (abs(hardwareDistance_i32) > 1) 
              {
                  float catchUpKp = 400.0f; 
                  catchUpSpeedHz = (float)(abs(hardwareDistance_i32) - 1) * catchUpKp; 
              }
            }

            // total speed
            requiredSpeed = requiredSpeed + catchUpSpeedHz;
            
            if (requiredSpeed > (float)MAXIMUM_STEPPER_SPEED_U32) {
                requiredSpeed = (float)MAXIMUM_STEPPER_SPEED_U32;
            }

            stepper->moveToWithSpeed((int32_t)Position_Next_fl32, requiredSpeed);
            s_lastCommandedTarget_i32 = (int32_t)Position_Next_fl32;
            s_lastCommandedSpeed_u32 = requiredSpeed;
  
          }
        }
        else
        {
          moveSlowlyToPosition_b = false;
          stepper->moveSlowlyToPos(Position_Next);
        }
      }
    
      // compute controller output
      dap_calculationVariables_st.stepperPosSetback();
      dap_calculationVariables_st.resetMaxForce();
      dap_calculationVariables_st.dynamicUpdate();
      dap_calculationVariables_st.updateStiffness();
      

      // compute joystick value
      if(dap_calculationVariables_st.rudderStatus_b&&dap_calculationVariables_st.rudderBrakeStatus_b)
      {
        if (1 == dap_config_pedalUpdateTask_st.payloadPedalConfig_st.travelAsJoystickOutput_u8)
        {
          joystickNormalizedToInt32_orig = NormalizeControllerOutputValue((stepperPosCurrent_i32-dap_calculationVariables_st.stepperPosRange_fl32/2), dap_calculationVariables_st.softEndstopMinStepperPos_i32, dap_calculationVariables_st.softEndstopMinStepperPos_i32+dap_calculationVariables_st.stepperPosRange_fl32/2.0f, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.maxGameOutput_u8);
        }
        else
        {
          joystickNormalizedToInt32_orig = NormalizeControllerOutputValue((FilterReadingJoystick/*filteredReading*/), dap_calculationVariables_st.forceMin_fl32, dap_calculationVariables_st.forceMax_fl32, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.maxGameOutput_u8);
        }
      }
      else
      {
        if (1 == dap_config_pedalUpdateTask_st.payloadPedalConfig_st.travelAsJoystickOutput_u8)
        {
          joystickNormalizedToInt32_orig = NormalizeControllerOutputValue(constrain(pedalArcPercentage_fl32, 0.0f, 1.0f), 0.0f, 1.0f, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.maxGameOutput_u8);
        }
        else
        {            
          joystickNormalizedToInt32_orig = NormalizeControllerOutputValue(FilterReadingJoystick/*filteredReading*/, dap_calculationVariables_st.forceMin_fl32, dap_calculationVariables_st.forceMax_fl32, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.maxGameOutput_u8);
        }
      }
      joystickfrac=(float)joystickNormalizedToInt32_orig/(float)s_JOYSTICK_MAX_VALUE_U16;
      joystickNormalizedToInt32_eval = forceCurve.EvalJoystickCubicSpline(&dap_config_pedalUpdateTask_st, &dap_calculationVariables_st, joystickfrac);
      
      joystickNormalizedToUInt16 = joystickNormalizedToInt32_eval/100.0f* s_JOYSTICK_MAX_VALUE_U16;
      joystickNormalizedToUInt16 = constrain(joystickNormalizedToUInt16, s_JOYSTICK_MIN_VALUE_U16, s_JOYSTICK_MAX_VALUE_U16);      


      // send joystick data to queue
      if (s_joystickDataQueue != NULL) {

        // send data every N-th frame
        sendJoystickDataCounter_u8++;
        if (sendJoystickDataCounter_u8 >= joystickSendCounterMax_u8) sendJoystickDataCounter_u8 = 0; // use instead of modulo due to runtime efficiency

        if (sendJoystickDataCounter_u8 == 0)
        {
          // Package the new state data into a single struct
          joystickDataPackage_t newJoystickPackage;
          newJoystickPackage.sendJoystickFlag_b = true;
          newJoystickPackage.joystickNormalizedToUInt16 = joystickNormalizedToUInt16;

          // Send the package to the queue. Use a timeout of 0 (non-blocking).
          // If the queue is full, the data is simply dropped. This prevents this
          // high-priority control task from ever blocking on a full serial buffer.
          xQueueSend(s_joystickDataQueue, &newJoystickPackage, (TickType_t)0);
        }
      }


      

      // provide joystick output on PIN
      #ifdef Using_analog_output
        int dac_value=(int)(joystickNormalizedToInt32*255/10000);
        dacWrite(DAC_OUTPUT_PIN_U8,dac_value);
      #endif

      #ifdef Using_analog_output_ESP32_S3
        if(MCP_status)
        {
          int dac_value=(int)(joystickNormalizedToInt32*4096*0.9/10000);//limit the max to 5V*0.9=4.5V to prevent the overvolatage
          dac.setVoltage(dac_value, false);
        }
      #endif

      
      
        if ( fabsf(dap_calculationVariables_st.forceRange_fl32) > 0.01f)
      {
          normalizedPedalReading_fl32 = constrain((filteredReading - dap_calculationVariables_st.forceMin_fl32) / dap_calculationVariables_st.forceRange_fl32, 0.0f, 1.0f);
      }
      
      // simulate ABS trigger 
      if(dap_config_pedalUpdateTask_st.payloadPedalConfig_st.simulateAbsTrigger_u8==1)
      {
        ABS_trigger_value=dap_config_pedalUpdateTask_st.payloadPedalConfig_st.simulateAbsValue_u8;
        if( (normalizedPedalReading_fl32*100.0f) > ABS_trigger_value)
        {
          absOscillation.trigger();
        }
      }

      // end profiler 6, ...
      profiler_pedalUpdateTask.end(6);

      // start profiler 8, struct exchange
      profiler_pedalUpdateTask.start(7);
      

  
      
      // update pedal states
      // check if data needs to be send
      if ( (dap_config_pedalUpdateTask_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT_U8) )
      {
        // send data every frame
        sendPedalStructsViaSerialCounter_u8 = 0;
        sendBasicFlag_b = true;
        sendExtendedFlag_b = true;
      }
      else
      {
        // send data every N-th frame
        sendPedalStructsViaSerialCounter_u8++;
        if (sendPedalStructsViaSerialCounter_u8 >= serialSendCounterMax_u8) {
            sendPedalStructsViaSerialCounter_u8 = 0;
            sendBasicFlag_b = true;
        } else {
            sendBasicFlag_b = false;
        }
        sendExtendedFlag_b = false;
      }

        if (sendBasicFlag_b)
        {
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalStateBasic_st.pedalForce_u16 =  normalizedPedalReading_fl32 * 65535.0f;
          // dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalStateBasic_st.pedalPosition_u16 = constrain(stepperPosFraction_fl32, 0.0f, 1.0f) * 65535.0f;
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalStateBasic_st.pedalPosition_u16 = constrain(pedalArcPercentage_fl32, 0.0f, 1.0f) * 65535.0f;
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalStateBasic_st.joystickOutput_u16 = joystickNormalizedToUInt16;
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalStateBasic_st.pedalFirmwareVersion_au8[0] = g_versionMajor;
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalStateBasic_st.pedalFirmwareVersion_au8[1] = g_versionMinor;  
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalStateBasic_st.pedalFirmwareVersion_au8[2] = g_versionPatch;
          //error code
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalStateBasic_st.errorCode_u8 = 0;
          //pedal status update
          if(dap_calculationVariables_st.rudderStatus_b)
          {
            if(dap_calculationVariables_st.rudderBrakeStatus_b) dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalStateBasic_st.pedalStatus_u8=PEDAL_STATUS_RUDDERBRAKE;
            else dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalStateBasic_st.pedalStatus_u8=PEDAL_STATUS_RUDDER;
          }
          else dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalStateBasic_st.pedalStatus_u8=PEDAL_STATUS_NORMAL;
          //servo status update
          dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalStateBasic_st.servoStatus_u8=stepper->servoStatus;

          #ifdef ESPNOW_Enable
            if(g_ESPNow_error_code!=0)
            {
              dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalStateBasic_st.errorCode_u8=g_ESPNow_error_code;
              g_ESPNow_error_code=0;
            }
          #endif

          if( (stepper->getLifelineSignal()==false) && (stepper->servoStatus!=SERVO_IDLE_NOT_CONNECTED) )
          {
            dap_state_basic_st_lcl_pedalUpdateTask.payloadPedalStateBasic_st.errorCode_u8=12;
          }
          
          //fill the header
          dap_state_basic_st_lcl_pedalUpdateTask.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
          dap_state_basic_st_lcl_pedalUpdateTask.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
          dap_state_basic_st_lcl_pedalUpdateTask.payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
          dap_state_basic_st_lcl_pedalUpdateTask.payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;

          dap_state_basic_st_lcl_pedalUpdateTask.payloadHeader_st.payloadType_u8 = DAP_PAYLOAD_TYPE_STATE_BASIC_U8;
          dap_state_basic_st_lcl_pedalUpdateTask.payloadHeader_st.version_u8 = DAP_VERSION_CONFIG_U8;
          dap_state_basic_st_lcl_pedalUpdateTask.payloadHeader_st.pedalTag_u8 = dap_config_pedalUpdateTask_st.payloadPedalConfig_st.pedalType_u8;        
          
