ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
        }

        if (sendExtendedFlag_b)
        {
          // update extended pedal structures
          dap_state_extended_st_lcl_pedalUpdateTask.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8; // 170
          dap_state_extended_st_lcl_pedalUpdateTask.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8; // 85

          dap_state_extended_st_lcl_pedalUpdateTask.payloadFooter_st.enfOfFrame0_u8 =  EOF_BYTE_0_U8; // 170
          dap_state_extended_st_lcl_pedalUpdateTask.payloadFooter_st.enfOfFrame1_u8 =  EOF_BYTE_1_U8; // 86

          dap_state_extended_st_lcl_pedalUpdateTask.payloadHeader_st.pedalTag_u8 = dap_config_pedalUpdateTask_st.payloadPedalConfig_st.pedalType_u8;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadHeader_st.payloadType_u8 = DAP_PAYLOAD_TYPE_STATE_EXTENDED_U8;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadHeader_st.version_u8 = DAP_VERSION_CONFIG_U8;


          // update extended struct 
          int32_t minPos = 0; //stepper->getMinPosition();

          // Servo states (values cached earlier in the cycle)
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.servoStateCycleCount_u32  = cached_servoCycleCounter_u32;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.servoPositionTarget_i32   = cached_servosInternalPosCorrected_i32;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.servoPositionFeedback_i32 = cached_servosInternalPosCorrected_i32 + cached_servosPosError_i32 - minPos;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.servoPositionError_i16    = cached_servosPosError_i32;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.servoVoltage0p1V_i16      = cached_servosVoltage_i16;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.servoCurrentPercent_i16   = cached_servosCurrent_i16;

          // ESP states
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.timeInUs_u32 = cycleCallTimeInUs_u32;//micros();
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.cycleCount_u32 = cycleCount_u32;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.pedalForceRaw_fl32 =  loadcellReading;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.pedalForceFiltered_fl32 =  filteredReading;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.forceVelEst_fl32 =  changeVelocity;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.targetPosition_i32   = stepperPosCurrent_i32 - minPos;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.currentSpeedInHz_i32 = cached_currentSpeedInHz_i32;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.brakeResistorState_b = brake_state * 255;//stepper->getBrakeResistorState();
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.oscillationMonitorValue_u8 = 0.0f;
        
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.admittance_expectedForce_N = admittanceDebugInfo_st.expectedForce_N;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.admittance_isOscillating = admittanceDebugInfo_st.isOscillating;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.admittance_admittancePsi_N = admittanceDebugInfo_st.admittancePsi_N;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.admittance_virtualMass_kg = admittanceDebugInfo_st.activeVirtualMass_kg + admittanceDebugInfo_st.massAdaptationOffset_kg;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.admittance_virtualDamping_Ns_m = admittanceDebugInfo_st.activeDamping_Ns_m;
          
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.admittance_virtualPosition_m = admittanceStates_st.physicalPos_m;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.admittance_virtualVelocity_mps = admittanceStates_st.virtualVel_mps;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.admittance_virtualAcceleration_mps2 = admittanceStates_st.virtualAcc_mps2;

        }

          // Package the new state data into a unified struct
          TxMessage_t txMsg;
          txMsg.type = TX_MSG_PEDAL_STATE;
          txMsg.payload.pedalState.basic_st = dap_state_basic_st_lcl_pedalUpdateTask;
          txMsg.payload.pedalState.extended_st = dap_state_extended_st_lcl_pedalUpdateTask;
          txMsg.payload.pedalState.sendBasicFlag_b = sendBasicFlag_b;
          txMsg.payload.pedalState.sendExtendedFlag_b = sendExtendedFlag_b;

          if (s_unifiedTxQueue != NULL) {
            // Send the package to the unified queue. Use a timeout of 0 (non-blocking).
            xQueueSend(s_unifiedTxQueue, &txMsg, (TickType_t)0);
          }
          
          #ifdef ESPNOW_Enable
          if (s_espnowStateQueue != NULL) {
            // Overwrite the single-element mailbox queue with the latest state
            xQueueOverwrite(s_espnowStateQueue, &txMsg.payload.pedalState);
          }
          #endif



      profiler_pedalUpdateTask.end(7);
      profiler_pedalUpdateTask.end(0);
    }
  }
}

  






/**********************************************************************************************/
/*                                                                                            */
/*                         joystick output task                                               */
/*                                                                                            */
/**********************************************************************************************/

#ifdef USB_JOYSTICK
void IRAM_ATTR_FLAG joystickOutputTask( void * pvParameters )
{ 

  // FunctionProfiler profiler_joystickOutputTask;
  // profiler_joystickOutputTask.setName("JoystickOutput");
  // profiler_joystickOutputTask.setNumberOfCalls(500);
  // configDataPackage_t configPackage_st;
  // static DapConfig_t jut_dap_config_st;
  

