ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
                        }

                        #ifdef ESPNOW_Enable
                          if(received_action.payloadPedalAction_st.rudderAction_u8==1)//Enable Rudder
                          {
                            if(dap_calculationVariables_st.rudderStatus_b==false)
                            {
                              dap_calculationVariables_st.rudderStatus_b=true;
                              ActiveSerial->println("Rudder on");
                              Rudder_initializing=true;
                              moveSlowlyToPosition_b=true;
                              //ActiveSerial->print("status:");
                              //ActiveSerial->println(dap_calculationVariables_st.rudderStatus_b);
                            }
                            else
                            {
                              dap_calculationVariables_st.rudderStatus_b=false;
                              ActiveSerial->println("Rudder off");
                              Rudder_deinitializing=true;
                              moveSlowlyToPosition_b=true; 

                              //ActiveSerial->print("status:");
                              //ActiveSerial->println(dap_calculationVariables_st.rudderStatus_b);
                            }
                          }
                          if(received_action.payloadPedalAction_st.rudderBrakeAction_u8==1)
                          {
                            if(dap_calculationVariables_st.rudderBrakeStatus_b==false&&dap_calculationVariables_st.rudderStatus_b==true)
                            {
                              dap_calculationVariables_st.rudderBrakeStatus_b=true;
                              ActiveSerial->println("Rudder brake on");
                              //ActiveSerial->print("status:");
                              //ActiveSerial->println(dap_calculationVariables_st.rudderStatus_b);
                            }
                            else
                            {
                              dap_calculationVariables_st.rudderBrakeStatus_b=false;
                              ActiveSerial->println("Rudder brake off");
                              //ActiveSerial->print("status:");
                              //ActiveSerial->println(dap_calculationVariables_st.rudderStatus_b);
                            }
                          }
                          //clear rudder status
                          if(received_action.payloadPedalAction_st.rudderAction_u8==2)
                          {
                            dap_calculationVariables_st.rudderStatus_b=false;
                            dap_calculationVariables_st.rudderBrakeStatus_b=false;
                            ActiveSerial->println("Rudder Status Clear");
                            Rudder_deinitializing=true;
                            moveSlowlyToPosition_b=true;

                          }
                        #endif
                      }
                      break;
                  }
                  case DAP_PAYLOAD_TYPE_ACTION_OTA_U8:{
                    memcpy(&dap_action_ota_st, packet_start, sizeof(DapActionOta_t));
                    ActiveSerial->println("Get OTA command");
                    buzzerBeepAction_b=true;

                    //ActiveSerial->readBytes((char*)&dap_action_ota_st, sizeof(DapActionOta_t));
                    #ifdef OTA_update
                      if(dap_action_ota_st.payloadHeader_st.payloadType_u8==DAP_PAYLOAD_TYPE_ACTION_OTA_U8)
                      {
                        if(dap_action_ota_st.payloadOtaInfo_st.deviceId_u8 == sct_dap_config_st.payloadPedalConfig_st.pedalType_u8)
                        {
                          g_SSID=new char[dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8+1];
                          g_PASS=new char[dap_action_ota_st.payloadOtaInfo_st.passLength_u8+1];
                          memcpy(g_SSID,dap_action_ota_st.payloadOtaInfo_st.wifiSsid_au8,dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8);
                          memcpy(g_PASS,dap_action_ota_st.payloadOtaInfo_st.wifiPass_au8,dap_action_ota_st.payloadOtaInfo_st.passLength_u8);
                          g_SSID[dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8]=0;
                          g_PASS[dap_action_ota_st.payloadOtaInfo_st.passLength_u8]=0;
                          g_OTA_enable_b=true;
                          g_OTA_enable_start=true;
                          #ifdef ESPNOW_Enable
                            g_ESPNow_OTA_enable=false;
                          #endif
                        }
                      }
                    #else
                      ActiveSerial->println("The command is not supported");
                    #endif    
                    break;
                  }
                  case DAP_PAYLOAD_TYPE_SERVO_CONFIG_U8: {
                      DAP_servo_config_st received_servo_config;
                      memcpy(&received_servo_config, packet_start, sizeof(DAP_servo_config_st));

                      calculated_crc = checksumCalculator_u16((uint8_t*)(&(received_servo_config.payloadHeader_st)), sizeof(received_servo_config.payloadHeader_st) + sizeof(received_servo_config.payloadServoConfig_st));
                      received_crc = received_servo_config.payloadFooter_st.checkSum_u16;

                      if (calculated_crc != received_crc || received_servo_config.payloadHeader_st.version_u8 != DAP_VERSION_CONFIG_U8)
                      {
                          structIsValid = false;
                      }
                      else
                      {
                          ActiveSerial->println("Valid servo config packet received");
                          if (s_servoConfigRxQueue != NULL) {
                              xQueueSend(s_servoConfigRxQueue, &received_servo_config, (TickType_t)0);
                          }
                      }
                      break;
                  }
                } // end switch

                if (!structIsValid)
                {
                  ActiveSerial->printf("Invalid packet detected (Type: %d). Skipping SOF.\n", payloadType);
                  buffer_idx++; // Skip the failed SOF and continue scanning
                }
                else
                {
                  // Packet was valid and processed, advance index past this packet
                  buffer_idx += expectedSize;
              }
            } // end while

            // --- 3. Clean up the buffer ---
            if (buffer_idx > 0)
            {
            size_t remaining_len = buffer_len - buffer_idx;
              if (remaining_len > 0)
              {
                memmove(rx_buffer, &rx_buffer[buffer_idx], remaining_len);
            }
            buffer_len = remaining_len;
          }

          profiler_serialCommunicationTask.end(0);
          profiler_serialCommunicationTask.report();
        } // end if TaskNotifyTake
    } // end for(;;)
}




void IRAM_ATTR_FLAG serialCommunicationTaskTx( void * pvParameters )
{ 
  TxMessage_t msg;

  for (;;)
  {
    uint16_t itemsProcessed = 0;

    // 1. Unabhängiges Polling der Modbus-Antwort direkt vorm Queue-Lesen
    if (stepper != nullptr) {
      uint16_t addr_u16 = 0;
      int16_t  vals[10] = {};
      uint16_t addrs[10] = {};
      uint8_t  cnt_u8   = 0;
      if (stepper->tryGetServoModbusReadResult(addr_u16, vals, cnt_u8, addrs) && cnt_u8 > 0) {
        DapConfig_t tmpConf;
        global_dap_config_class.getConfig(&tmpConf, 50);

