ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
        DAP_servo_config_st_t resp = {};
        resp.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
        resp.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
        resp.payloadHeader_st.payloadType_u8   = DAP_PAYLOAD_TYPE_SERVO_CONFIG_U8;
        resp.payloadHeader_st.version_u8       = DAP_VERSION_CONFIG_U8;
        resp.payloadHeader_st.storeToEeprom_u8 = 0;
        resp.payloadHeader_st.pedalTag_u8      = tmpConf.payloadPedalConfig_st.pedalType_u8;
        resp.payloadServoConfig_st.readWriteFlag  = 0; 
        resp.payloadServoConfig_st.numValidFields = cnt_u8;
        for (uint8_t i = 0; i < cnt_u8; i++) {
          resp.payloadServoConfig_st.registerAddresses[i] = addrs[i];
          resp.payloadServoConfig_st.registerValues[i]    = (uint16_t)vals[i];
        }
        resp.payloadFooter_st.checkSum_u16 = checksumCalculator_u16(
          (uint8_t*)(&resp.payloadHeader_st),
          sizeof(resp.payloadHeader_st) + sizeof(resp.payloadServoConfig_st));
        resp.payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
        resp.payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
        usbManager.write((const uint8_t*)&resp, sizeof(DAP_servo_config_st_t));

#ifdef ESPNOW_Enable
            ESPNow.send_message(g_broadcast_mac, (uint8_t*)&resp, sizeof(DAP_servo_config_st_t));
#endif
      }
    }

    // 2. Warte auf Daten (max 2ms blockieren, falls Queue leer ist)
    if (xQueueReceive(s_unifiedTxQueue, &msg, pdMS_TO_TICKS(2)) == pdPASS)
    {
      // Schleife, um Pakete im Batch abzuarbeiten
      do
      {
        if (msg.type == TX_MSG_PEDAL_STATE)
        {
          PedalStatePackage_t& receivedState = msg.payload.pedalState;
          DapStateBasic_t basic_to_send = receivedState.basic_st;
          DapStateExtended_t extended_to_send = receivedState.extended_st;

          
  
          if (receivedState.sendBasicFlag_b)
          {
            basic_to_send.payloadFooter_st.checkSum_u16 = checksumCalculator_u16((uint8_t*)(&(basic_to_send.payloadHeader_st)), sizeof(basic_to_send.payloadHeader_st) + sizeof(basic_to_send.payloadPedalStateBasic_st));
            usbManager.write((const uint8_t*)&basic_to_send, sizeof(DapStateBasic_t));
          }
  
          if (receivedState.sendExtendedFlag_b)
          {
            extended_to_send.payloadFooter_st.checkSum_u16 = checksumCalculator_u16((uint8_t*)(&(extended_to_send.payloadHeader_st)), sizeof(extended_to_send.payloadHeader_st) + sizeof(extended_to_send.payloadPedalStateExtended_st));
            usbManager.write((const uint8_t*)&extended_to_send, sizeof(DapStateExtended_t));
          }
        }
        else if (msg.type == TX_MSG_CONFIG)
        {
          usbManager.write((const uint8_t*)&msg.payload.config, sizeof(DapConfig_t));
          ActiveSerial->print("Return pedal config");
        }

        itemsProcessed++;
        if (itemsProcessed >= 60) {
          break; // Maximale Batch-Grö?e erreicht!
        }
      } while (xQueueReceive(s_unifiedTxQueue, &msg, 0) == pdPASS);
    }

    if (itemsProcessed >= 60) {
        // Watchdog-Feeder: CPU kurz abgeben, falls sehr viel los war
        vTaskDelay(pdMS_TO_TICKS(1)); 
    } else if (itemsProcessed > 0) {
        // Wenn der Buffer leer ist, direkt raussenden
        usbManager.flush();
    }

    usbManager.processTxBatch();

  } // <-- Ende der for(;;) Schleife
}
          

/**********************************************************************************************/

  


/**********************************************************************************************/
/*                                                                                            */
/*                         servo config handling                                              */
/*                                                                                            */
/**********************************************************************************************/
void IRAM_ATTR_FLAG servoConfigHandlingTask( void * pvParameters )
{
  DAP_servo_config_st received_servo_config;

  for (;;)
  {
    if (xQueueReceive(s_servoConfigRxQueue, &received_servo_config, portMAX_DELAY) == pdPASS)
    {
      uint8_t validFields = received_servo_config.payloadServoConfig_st.numValidFields;
      if (validFields > 10) validFields = 10;

      if (validFields > 0 && stepper != nullptr) {
          ServoModbusCmd_t cmd = {};
          cmd.count_u8  = validFields;
          cmd.isWrite_b = (received_servo_config.payloadServoConfig_st.readWriteFlag == 1);
          for (uint8_t i = 0; i < cmd.count_u8; i++) {
              cmd.readAddresses[i] = received_servo_config.payloadServoConfig_st.registerAddresses[i];
              cmd.values[i] = received_servo_config.payloadServoConfig_st.registerValues[i];
          }
          stepper->scheduleServoModbusCmd(cmd);
      }
    }
  }
}


//OTA multitask
void otaUpdateTask( void * pvParameters )
{
  uint16_t OTA_count = 0;
  unsigned long ota_debug_messaage_last = 0;
  bool message_out_b = false;
  int OTA_update_status = 99;

  for (;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0)
    {

      if (OTA_count > 200)
      {
        message_out_b = true;
        OTA_count = 0;
      }
      else
      {
        OTA_count++;
      }

      #if defined(OTA_update)  || defined(OTA_update_ESP32)
      if(g_OTA_enable_b)
      {
        if(message_out_b)
        {
          message_out_b=false;
          Serial1.println("OTA enable flag on");
        }
        if(g_OTA_status)
        {
          #ifdef OTA_update_ESP32
            server.handleClient();
          #endif
          #ifdef OTA_update
            if(OTA_update_status==0)
            {
              Buzzer.play_melody_tone(melody_victory_theme, sizeof(melody_victory_theme)/sizeof(melody_victory_theme[0]),melody_durations_Victory_theme);              
              ESP.restart();
            }
            else
            {
              if(dap_action_ota_st.payloadOtaInfo_st.otaAction_u8==OTA_ACTION_PLATFORMIO_DIRECT_UPLOAD)
              {
                //updload ota from platformio
                //sendESPNOWLog("Upload from platformIO");
                ArduinoOTA.handle(); 
                if(millis()-ota_debug_messaage_last>1000)
                {
                  ActiveSerial->println("Wait for ota update...");
                }
                
