ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
              }
              else
              {
                //show ota error
                Buzzer.single_beep_tone(770,100);
                #ifdef USING_LED
                  pixels.setPixelColor(0,0xff,0x00,0x00);//red
                  pixels.show(); 
                  delay(500);
                  pixels.setPixelColor(0,0x00,0x00,0x00);//no color
                  pixels.show();
                  delay(500);    
                #endif 
              }

            }

          #endif
          

        }
        else
        {
          esp_err_t result;
          ActiveSerial->println("de-initialize espnow");
          ActiveSerial->println("wait...");
          #ifdef ESPNOW_Enable
            sendESPNOWLog("OTA enabled, de-initialize espnow");
            sendESPNOWLog("wait...");
            delay(1000);
            result= esp_now_deinit();
            g_ESPNow_initial_status=false;
            g_ESPNOW_status=false;
          #else
            result = ESP_OK;
          #endif
          //result = ESP_OK;
          delay(3000);
          if(result==ESP_OK)
          {
            g_OTA_status=true;
 // notify pedal task to stop movement
            uint8_t ota_event = 1;
            xQueueSend(s_systemControlQueue, &ota_event, (TickType_t)0);
            Buzzer.single_beep_tone(700,100); 
            delay(1000);
            #ifdef OTA_update_ESP32
            ota_wifi_initialize(g_apHost_pc);
            #endif
            #ifdef USING_LED
                //pixels.setBrightness(20);
                pixels.setPixelColor(0,0x00,0x00,0xff);//Blue
                pixels.show(); 
                //delay(3000);
            #endif
            #ifdef OTA_update
            wifi_initialized(g_SSID,g_PASS);
            delay(2000);
            //sendESPNOWLog("Wifi Connected");
            if(dap_action_ota_st.payloadOtaInfo_st.otaAction_u8!=OTA_ACTION_PLATFORMIO_DIRECT_UPLOAD)
            {
              ESP32OTAPull ota;
              int ret;
              ota.SetCallback(OTAcallback);
              ota.OverrideBoard(CONTROL_BOARD);
              char* versionTag_pc;
              if(dap_action_ota_st.payloadOtaInfo_st.otaAction_u8==OTA_ACTION_FORCE_UPDATE)
              {
                const char* versionTagSource_pc;
                if(PCB_VERSION==3||PCB_VERSION==5||PCB_VERSION==9) versionTagSource_pc ="0.90.16";// for those board which change the partition table
                else versionTagSource_pc ="0.0.0";
                versionTag_pc=new char[strlen(versionTagSource_pc) + 1];
                strcpy(versionTag_pc, versionTagSource_pc);
                ActiveSerial->println("Force update");
              }
              if(dap_action_ota_st.payloadOtaInfo_st.otaAction_u8==OTA_ACTION_NORMAL)
              {
                versionTag_pc=new char[strlen(DAP_FIRMWARE_VERSION) + 1];
                strcpy(versionTag_pc, DAP_FIRMWARE_VERSION);
                //version_tag=DAP_FIRMWARE_VERSION;
              }
              switch (dap_action_ota_st.payloadOtaInfo_st.modeSelect_u8)
              {
                case 1:
                  ActiveSerial->printf("Flashing to latest release, checking %s to see if an update is available...\n", OTA_JSON_URL_MAIN);
                  ret = ota.CheckForOTAUpdate(OTA_JSON_URL_MAIN, versionTag_pc, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
                  ActiveSerial->printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                  OTA_update_status=ret;
                  break;
                case 2:
                  ActiveSerial->printf("Flashing to latest dev build, checking %s to see if an update is available...\n", OTA_JSON_URL_DEV);
                  ret = ota.CheckForOTAUpdate(OTA_JSON_URL_DEV, versionTag_pc, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
                  ActiveSerial->printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                  OTA_update_status=ret;
                  break;
                case 3:
                  ActiveSerial->printf("Flashing to test build, checking %s to see if an update is available...\n", OTA_JSON_URL_TEST);
                  ret = ota.CheckForOTAUpdate(OTA_JSON_URL_TEST, versionTag_pc, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
                  ActiveSerial->printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                  OTA_update_status=ret;
                  break;
                default:
                break;
                delete[] versionTag_pc; 
              }
            }  
            else
            {
              // initialize ota for platformIO upload
              ActiveSerial->println("OTA from platformIO");
              ota_arduinoota_initialize();
            }         
            #endif
            delay(3000);
          }

        }
      }
      
      #endif
    }

    // force a context switch
		taskYIELD();
  }
}

#ifdef ESPNOW_Enable

void IRAM_ATTR_FLAG espNowCommunicationTaskTx( void * pvParameters )
{
  FunctionProfiler profiler_espNow;
  profiler_espNow.setName("EspNow");

  uint Pairing_timeout=20000;
  uint rudderPacketInterval=3;
  uint joystickPacketInterval=3;
  uint basicStateUpdateIntervalBase[3]={5,4,3};
  uint extendStateUpdateInterval=10;
  uint assignmentPacketUpdateInterval = 100;
  bool Pairing_timeout_status=false;
  bool building_dap_esppairing_lcl =false;
  unsigned long Pairing_state_start;
  unsigned long Pairing_state_last_sending;
  unsigned long Debug_rudder_last=0;
  unsigned long basic_state_update_last=0;
  unsigned long extend_state_update_last=0;
  unsigned long rudderPacketsUpdateLast=0;
  unsigned long joystickPacketsUpdateLast=0;
  unsigned long assignmentPacketUpdateLast = 0;
  uint32_t espNowTask_stackSizeIdx_u32 = 0;

  int error_count=0;
  int print_count=0;
  int ESPNow_no_device_count=0;
  bool basic_state_send_b=false;
  bool extend_state_send_b=false;
  bool noAssignmentStatus=false;
  bool assignmentUpdatePacketSend_b=false;
  uint8_t error_out;

  for(;;)
  {
      if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {


        DapConfig_t espnow_dap_config_st;
        global_dap_config_class.getConfig(&espnow_dap_config_st, 500);
        //basic state sendout interval
        uint basicStateUpdateInterval = 8;
        int pedalId=espnow_dap_config_st.payloadPedalConfig_st.pedalType_u8;
        if(pedalId < 3) basicStateUpdateInterval= basicStateUpdateIntervalBase[pedalId];
        if(millis()-basic_state_update_last>basicStateUpdateInterval)
        {
          basic_state_send_b=true;
          basic_state_update_last=millis();
          
