ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
        }
        if (espnow_dap_config_st.payloadPedalConfig_st.pedalType_u8 ==PEDAL_ID_UNKNOWN)
        {
          noAssignmentStatus=true;
        }
        //restart from espnow
        if(g_ESPNow_restart)
        {
          ActiveSerial->println("ESP restart by ESPnow request");
          sendESPNOWLog("Pedal:%d restarted by request", espnow_dap_config_st.payloadPedalConfig_st.pedalType_u8);
          delay(2);
          ESP.restart();
        }
        //entend state send out interval
        if((millis()-extend_state_update_last>extendStateUpdateInterval) && espnow_dap_config_st.payloadPedalConfig_st.debugFlags0_u8 == DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT_U8)
        {
          extend_state_send_b=true;
          extend_state_update_last=millis();
          
        }
        if (millis() - assignmentPacketUpdateLast > assignmentPacketUpdateInterval)
        {
          assignmentUpdatePacketSend_b = true;
          assignmentPacketUpdateLast = millis();
        }
        // activate profiler depending on pedal config
        if (espnow_dap_config_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_CYCLE_TIMER_U8) 
        {
          profiler_espNow.activate( true );
        }
        else
        {
          profiler_espNow.activate( false );
        }

        // start profiler 0, overall function
        profiler_espNow.start(0);

        
        if(g_ESPNow_initial_status==false  )
        {
          if(g_OTA_enable_b==false)
          {
            ESPNow_initialize();
          }
          
        }
        else
        {
          #ifdef ESPNow_Pairing_function
          #ifdef Hardware_Pairing_button
            if(digitalRead(PAIRING_GPIO_U8)==LOW)
            {
              hardware_pairing_action_b=true;
            }
          #endif
            if(hardware_pairing_action_b||software_pairing_action_b)
            {
              ActiveSerial->println("Pedal Pairing.....");
              delay(1000);
              Pairing_state_start=millis();
              Pairing_state_last_sending=millis();
              ESPNow_pairing_action_b=true;
              building_dap_esppairing_lcl=true;
              software_pairing_action_b=false;
              hardware_pairing_action_b=false;
              
            }
            if(ESPNow_pairing_action_b)
            {
              unsigned long now=millis();
              //sending package
              if(building_dap_esppairing_lcl)
              {
                uint16_t crc=0;          
                building_dap_esppairing_lcl=false;
                dap_esppairing_lcl.payloadEspnowInfo_st.deviceId_u8 = espnow_dap_config_st.payloadPedalConfig_st.pedalType_u8;
                dap_esppairing_lcl.payloadHeader_st.payloadType_u8 = DAP_PAYLOAD_TYPE_ESPNOW_PAIRING_U8;
                dap_esppairing_lcl.payloadHeader_st.pedalTag_u8 = espnow_dap_config_st.payloadPedalConfig_st.pedalType_u8;
                dap_esppairing_lcl.payloadHeader_st.version_u8 = DAP_VERSION_CONFIG_U8;
                crc = checksumCalculator_u16((uint8_t*)(&(dap_esppairing_lcl.payloadHeader_st)), sizeof(dap_esppairing_lcl.payloadHeader_st) + sizeof(dap_esppairing_lcl.payloadEspnowInfo_st));
                dap_esppairing_lcl.payloadFooter_st.checkSum_u16=crc;
              }
              if(now-Pairing_state_last_sending>400)
              {
                Pairing_state_last_sending=now;
                ESPNow.send_message(g_broadcast_mac,(uint8_t *) &dap_esppairing_lcl, sizeof(dap_esppairing_lcl));
              }

              

              //timeout check
              if(now-Pairing_state_start>Pairing_timeout)
              {
                ESPNow_pairing_action_b=false;
                ActiveSerial->print("Pedal: ");
                ActiveSerial->print(espnow_dap_config_st.payloadPedalConfig_st.pedalType_u8);
                ActiveSerial->println(" timeout.");
                Buzzer.single_beep_tone(700,100);
                if(g_UpdatePairingToEeprom)
                {
                  EEPROM.put(EEPROM_OFFSET_U32,_ESP_pairing_reg);
                  EEPROM.commit();
                  g_UpdatePairingToEeprom=false;
                  //list eeprom
                  ESP_pairing_reg ESP_pairing_reg_local;
                  EEPROM.get(EEPROM_OFFSET_U32, ESP_pairing_reg_local);
                  for(int i=0;i<4;i++)
                  {
                    if(ESP_pairing_reg_local.Pair_status[i]==1)
                    {
                      ActiveSerial->print("#");
                      ActiveSerial->print(i);
                      ActiveSerial->print("Pair: ");
                      ActiveSerial->print(ESP_pairing_reg_local.Pair_status[i]);
                      ActiveSerial->printf(" Mac: %02X:%02X:%02X:%02X:%02X:%02X\n", ESP_pairing_reg_local.Pair_mac[i][0], ESP_pairing_reg_local.Pair_mac[i][1], ESP_pairing_reg_local.Pair_mac[i][2], ESP_pairing_reg_local.Pair_mac[i][3], ESP_pairing_reg_local.Pair_mac[i][4], ESP_pairing_reg_local.Pair_mac[i][5]);
                    }
                  }
                  //adding peer
                  
                  for(int i=0; i<4;i++)
                  {
                    if(_ESP_pairing_reg.Pair_status[i]==1)
                    {
                      if(i==0)
                      {
                        ESPNow.remove_peer(g_Clu_mac);
                        memcpy(&g_Clu_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                        delay(100);
                        ESPNow.add_peer(g_Clu_mac);
                        
                      }
                      if(i==1)
                      {
                        ESPNow.remove_peer(g_Brk_mac);
                        memcpy(&g_Brk_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                        delay(100);
                        ESPNow.add_peer(g_Brk_mac);
                      }
                      if(i==2)
                      {
                        ESPNow.remove_peer(g_Gas_mac);
                        memcpy(&g_Gas_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                        delay(100);
                        ESPNow.add_peer(g_Gas_mac);
                      }        
                      if(i==3)
                      {
                        ESPNow.remove_peer(g_esp_Host);
                        memcpy(&g_esp_Host,&_ESP_pairing_reg.Pair_mac[i],6);
                        delay(100);
                        ESPNow.add_peer(g_esp_Host);                
                      }        
                      if(espnow_dap_config_st.payloadPedalConfig_st.pedalType_u8==1)
                      {
                        memcpy(g_Recv_mac, g_Gas_mac, 6);
                      }
                      if(espnow_dap_config_st.payloadPedalConfig_st.pedalType_u8==2)
                      {
                        memcpy(g_Recv_mac, g_Brk_mac, 6);
                      }
                    }
                  }
                }
              }
            }
          #endif

