ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
          }

          if (printPedalInfo_b && !noAssignmentStatus)
          {
            printPedalInfo_b=false;
            buzzerBeepAction_b=true;
            delay(100);
             pedalInfoBuilder.BuildInfoString(espnow_dap_config_st.payloadPedalConfig_st.pedalType_u8, CONTROL_BOARD, loadcell->getBiasEstimate(), loadcell->getStandardDeviationEstimate(), ((float)stepper->getServosVoltage()/10.0f),dap_calculationVariables_st.stepperPosMaxEndstop_i32,dap_calculationVariables_st.currentPedalPosition_u32);
            sendESPNOWLog(pedalInfoBuilder.logString);
            ActiveSerial->println(pedalInfoBuilder.logString);
            delay(3);
            pedalInfoBuilder.BuildESPNOWInfo(espnow_dap_config_st.payloadPedalConfig_st.pedalType_u8,g_rssi);
            sendESPNOWLog(pedalInfoBuilder.logESPNOWString);
            ActiveSerial->println(pedalInfoBuilder.logESPNOWString);

          }
          if (Get_Rudder_action_b && !noAssignmentStatus)
          {
            Get_Rudder_action_b=false;
            Buzzer.single_beep_tone(700,100);
          }
          if (Get_HeliRudder_action_b && !noAssignmentStatus)
          {
            Get_HeliRudder_action_b=false;
            Buzzer.single_beep_tone(700,100);
          }
          if (ESPNOW_BootIntoDownloadMode && !noAssignmentStatus)
          {
            #ifdef ESPNow_S3
              ActiveSerial->println("Restart into Download mode");
              sendESPNOWLog("Pedal:%d restart into Download mode", espnow_dap_config_st.payloadPedalConfig_st.pedalType_u8);
              delay(1000);
              REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
              ESP.restart();
            #else
              ActiveSerial->println("Command not supported");
              delay(1000);
            #endif
            ESPNOW_BootIntoDownloadMode = false;
          }
          //send out rudder packet after rudder initialized
          if (rudderPacketsUpdateLast - millis() > rudderPacketInterval && !noAssignmentStatus)
          {
            if((dap_calculationVariables_st.rudderStatus_b || dap_calculationVariables_st.helicopterRudderStatus_b) && (!Rudder_initializing && !HeliRudder_initializing))
            {              
               dap_rudder_sending.payloadRudderState_st.pedalPositionRatio_fl32=dap_calculationVariables_st.currentPedalPositionRatio_fl32;
               dap_rudder_sending.payloadRudderState_st.pedalPosition_u16=dap_calculationVariables_st.currentPedalPosition_u32;
              dap_rudder_sending.payloadHeader_st.payloadType_u8=DAP_PAYLOAD_TYPE_ESPNOW_RUDDER_U8;
              dap_rudder_sending.payloadHeader_st.pedalTag_u8 = espnow_dap_config_st.payloadPedalConfig_st.pedalType_u8;
              dap_rudder_sending.payloadHeader_st.version_u8=DAP_VERSION_CONFIG_U8;
              uint16_t crc=0;
              crc = checksumCalculator_u16((uint8_t*)(&(dap_rudder_sending.payloadHeader_st)), sizeof(dap_rudder_sending.payloadHeader_st) + sizeof(dap_rudder_sending.payloadRudderState_st));
              dap_rudder_sending.payloadFooter_st.checkSum_u16=crc;
              ESPNow.send_message(g_broadcast_mac,(uint8_t *) &dap_rudder_sending,sizeof(dap_rudder_sending));   
               //ESPNow_send=dap_calculationVariables_st.currentPedalPosition_u32; 
              //esp_err_t result =ESPNow.send_message(Recv_mac,(uint8_t *) &_ESPNow_Send,sizeof(_ESPNow_Send));                
              //if (result == ESP_OK) 
              //{
              //  ActiveSerial->println("Error sending the data");
              //}
              if (g_ESPNow_Rudder_Update && !noAssignmentStatus)
              {
                //dap_calculationVariables_st.syncPedalPosition_u32=ESPNow_recieve;
                dap_calculationVariables_st.syncPedalPosition_u32=dap_rudder_receiving.payloadRudderState_st.pedalPosition_u16;
                dap_calculationVariables_st.syncPedalPositionRatio_fl32=dap_rudder_receiving.payloadRudderState_st.pedalPositionRatio_fl32;
                g_ESPNow_Rudder_Update=false;
              }                
            }
            rudderPacketsUpdateLast=millis();
          }    
        }

        #ifdef ESPNow_debug_rudder
          if(print_count>1000)
          {
            if(dap_calculationVariables_st.rudderStatus_b)
            {
              ActiveSerial->print("Pedal:");
              ActiveSerial->print(espnow_dap_config_st.payloadPedalConfig_st.pedalType_u8);
              ActiveSerial->print(", Send %: ");
              ActiveSerial->print(dap_rudder_sending.payloadRudderState_st.pedalPositionRatio_fl32);
              ActiveSerial->print(", Recieve %:");
              ActiveSerial->print(dap_rudder_receiving.payloadRudderState_st.pedalPositionRatio_fl32);
              ActiveSerial->print(", Send Position: ");
               ActiveSerial->print(dap_calculationVariables_st.currentPedalPosition_u32);
              ActiveSerial->print(", % in cal: ");
               ActiveSerial->print(dap_calculationVariables_st.currentPedalPositionRatio_fl32); 
              ActiveSerial->print(", min cal: ");
              ActiveSerial->print(dap_calculationVariables_st.stepperPosMinDefault_i32); 
              ActiveSerial->print(", max cal: ");
              ActiveSerial->print(dap_calculationVariables_st.stepperPosMaxDefault_i32);
              ActiveSerial->print(", range in cal: ");
              ActiveSerial->println(dap_calculationVariables_st.stepperPosRangeDefault_fl32); 
            }

            //Debug_rudder_last=now_rudder;
             //ActiveSerial->println(dap_calculationVariables_st.currentPedalPosition_u32);                  
                
            print_count=0;
          }
          else
          {
            print_count++;
                
          } 
              
                  
        #endif



      }

      profiler_espNow.end(0);

      // print profiler results
      profiler_espNow.report();

      // force a context switch
		taskYIELD();
    }
}
#endif


void miscTask( void * pvParameters )
{
  static DapConfig_t misc_dap_config_st;
  // for the task no need complete asap, ex buzzer, led 
  for(;;)
  {
    global_dap_config_class.getConfig(&misc_dap_config_st, 500);
    
    #ifdef ESPNOW_Enable
      //software assignment
      if(assignmentUpdate_b)
      {
        assignmentUpdate_b = false;
        writeAssignmentToEeprom();
        delay(1000);
        //restart after aassignment
        ESP.restart();
      }
      if (assignmentClear_b)
      {
        assignmentClear_b = false;
        clearAssignmentToEeprom();
        delay(1000);
        // restart after aassignment
        ESP.restart();
      }
#endif
    // make buzzer sound actions here
    #ifdef ESPNOW_Enable
      if (Config_update_Buzzer_b)
      {
        Buzzer.single_beep_tone(700, 50);
        Config_update_Buzzer_b = false;
      }
      if (assignmentUpdateBuzzer_b)
      {
        ActiveSerial->println("Beep");
        Buzzer.single_beep_tone(700, 50);
        assignmentUpdateBuzzer_b = false;
      }
      if(buzzerBeepAction_b)
      {
        Buzzer.single_beep_tone(700,50);
        buzzerBeepAction_b=false;
      }
    #endif
    #if defined(OTA_update) && defined(USING_BUZZER)
      if(g_beepForOtaProgress)
      {
        Buzzer.single_beep_tone(700,50);
        g_beepForOtaProgress=false;
      }
    #endif
    delay(50);
  }
}
